tests/com/l7tech/service/resources/wsTrustSecurityContextRequest_unsigned.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <wst:RequestSecurityToken Context="http://www.layer7tech.com/uuid/ctx/8273616719283726" xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust">
            <wst:TokenType>http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct</wst:TokenType>
            <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
            <wst:Base>
                <wsse:SecurityTokenReference>
                    <!-- this reference needs to be updated after the security header is added -->
                    <wsse:Reference URI="#UsernameToken-0-97803a4d931a40d196bcc93a7deac372" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken"/>
                </wsse:SecurityTokenReference>
            </wst:Base>
            <wst:Entropy>
                <wst:BinarySecret>BQIEBQgHCQYgBAE3CAdNBw==</wst:BinarySecret>
            </wst:Entropy>
            <wst:Lifetime xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsu:Created>2004-08-05T22:54:31Z</wsu:Created>
                <wsu:Expires>2004-08-06T22:54:31Z</wsu:Expires>
            </wst:Lifetime>
        </wst:RequestSecurityToken>
    </soapenv:Body>
</soapenv:Envelope>